from web3 import Web3

logo = "\
██████╗░░█████╗░███╗░░██╗░█████╗░███╗░░██╗░█████╗░  ░█████╗░██╗░░░░░██╗░░░░░██╗░█████╗░███╗░░██╗░█████╗░███████╗\n\
██╔══██╗██╔══██╗████╗░██║██╔══██╗████╗░██║██╔══██╗  ██╔══██╗██║░░░░░██║░░░░░██║██╔══██╗████╗░██║██╔══██╗██╔════╝\n\
██████╦╝███████║██╔██╗██║███████║██╔██╗██║███████║  ███████║██║░░░░░██║░░░░░██║███████║██╔██╗██║██║░░╚═╝█████╗░░\n\
██╔══██╗██╔══██║██║╚████║██╔══██║██║╚████║██╔══██║  ██╔══██║██║░░░░░██║░░░░░██║██╔══██║██║╚████║██║░░██╗██╔══╝░░\n\
██████╦╝██║░░██║██║░╚███║██║░░██║██║░╚███║██║░░██║  ██║░░██║███████╗███████╗██║██║░░██║██║░╚███║╚█████╔╝███████╗\n\
╚═════╝░╚═╝░░╚═╝╚═╝░░╚══╝╚═╝░░╚═╝╚═╝░░╚══╝╚═╝░░╚═╝  ╚═╝░░╚═╝╚══════╝╚══════╝╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚════╝░╚══════╝\n\
"

def create_with_mnemonic():
    w3 = Web3()
    w3.eth.account.enable_unaudited_hdwallet_features()
    new_account = w3.eth.account.create_with_mnemonic()
    return new_account[1], new_account[0]._private_key.hex(), new_account[0].address
 
if __name__ == "__main__":
    print(logo)
    print("Этот скрипт может сгенерировать указанное количество кошельков в формате МНЕМОНИКА, ПРИВАТНИК (первый по счету в метамаске), АДРЕС \nСколько кошельков генерируем?")

    try:
        n = int(input("Введите количество: "))
    except:
        print("Это не число, начинай сначала")
        exit()

    print(f"Генерируем {n} кошельков")
    
    with open("wallets.txt", 'w') as f:
        for i in range(n):
            print("Генерируем кошелек {}\t".format(i+1), end="")
            mnemonic, private_key, address = create_with_mnemonic()
            f.writelines("{},{},{}\n".format(mnemonic, private_key, address))
            print("OK")
        f.close()
            

